000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ДвиженияСерийныхНомеров/ДвиженияСерийныхНомеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДвиженияСерийныхНомеров</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>АналитикаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.АналитикаХозяйственныхОпераций</types>
    </type>
  </resources>
  <resources>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ЧекККМ</name>
    <type>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ДвиженияСерийныхНомеровКупонов/ДвиженияСерийныхНомеровКупонов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДвиженияСерийныхНомеровКупонов</name>
  <resources>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЧекККМ</name>
    <type>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Купон</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерийныйНомер</name>
    <type>
      <types>CatalogRef.СерийныеНомера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АналитикаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.АналитикаХозяйственныхОпераций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СрокДействияПодарочныхСертификатов/СрокДействияПодарочныхСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СрокДействияПодарочныхСертификатов</name>
  <enumValues>
    <name>БезОграниченияСрока</name>
  </enumValues>
  <enumValues>
    <name>СОграничениемНаДату</name>
  </enumValues>
  <enumValues>
    <name>ПериодПослеПродажи</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>День</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>СкидочныйКупон</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ХозяйственныеОперации</name>
  <enumValues>
    <name>ВозвратДенежныхСредствОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОплатыКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВДругуюКассу</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВДругуюОрганизацию</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствВКассуККМ</name>
  </enumValues>
  <enumValues>
    <name>ВыдачаДенежныхСредствИзКассыККМ</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлатыПоВедомостям</name>
  </enumValues>
  <enumValues>
    <name>ВыплатаЗаработнойПлатыРаботнику</name>
  </enumValues>
  <enumValues>
    <name>КомплектацияНоменклатуры</name>
  </enumValues>
  <enumValues>
    <name>КонвертацияВалюты</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОплатаФизическомуЛицу</name>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
  </enumValues>
  <enumValues>
    <name>ОприходованиеПоИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровДоРеализации</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровПослеРеализации</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПересортицаТоваровСПереоценкой</name>
  </enumValues>
  <enumValues>
    <name>ПогашениеПодарочныхСертификатов</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзБанка</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойКассы</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзДругойОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеДенежныхСредствИзКассыККМ</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеОплатыОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеТоваров</name>
  </enumValues>
  <enumValues>
    <name>ПриемТоваровОтДругойОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
  </enumValues>
  <enumValues>
    <name>РеализацияТоваров</name>
  </enumValues>
  <enumValues>
    <name>СдачаДенежныхСредствВБанк</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНаЗатраты</name>
  </enumValues>
  <enumValues>
    <name>СписаниеПоИнвентаризации</name>
  </enumValues>
  <enumValues>
    <name>СписаниеРасхожденийДенежныхСредств</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/АналитикаХозяйственныхОпераций/АналитикаХозяйственныхОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АналитикаХозяйственныхОпераций</name>
  <predefined>
    <items>
      <name>ВозвратОтПокупателя</name>
      <description>Возврат от покупателя</description>
    </items>
    <items>
      <name>ВозвратПоставщику</name>
      <description>Возврат поставщику</description>
    </items>
    <items>
      <name>КомплектацияНоменклатуры</name>
      <description>Комплектация номенклатуры</description>
    </items>
    <items>
      <name>ОприходованиеПоИнвентаризации</name>
      <description>Оприходование по инвентаризации</description>
    </items>
    <items>
      <name>ОприходованиеПоИнвентаризацииСамостоятельной</name>
      <description>Оприходование по инвентаризации самостоятельной</description>
    </items>
    <items>
      <name>ОприходованиеТоваров</name>
      <description>Оприходование товаров</description>
    </items>
    <items>
      <name>ПередачаПодарочныхСертификатовВПодарок</name>
      <description>Передача подарочных сертификатов в подарок</description>
    </items>
    <items>
      <name>ПередачаТоваровДоРеализации</name>
      <description>Передача товаров до реализации</description>
    </items>
    <items>
      <name>ПередачаТоваровПослеРеализации</name>
      <description>Передача товаров после реализации</description>
    </items>
    <items>
      <name>ПеремещениеТоваров</name>
      <description>Перемещение товаров</description>
    </items>
    <items>
      <name>ПересортицаТоваров</name>
      <description>Пересортица товаров</description>
    </items>
    <items>
      <name>ПогашениеПодарочныхСертификатов</name>
      <description>Погашение подарочных сертификатов</description>
    </items>
    <items>
      <name>ПоступлениеТоваров</name>
      <description>Поступление товаров</description>
    </items>
    <items>
      <name>ПриемТоваровОтДругойОрганизации</name>
      <description>Прием товаров от другой организации</description>
    </items>
    <items>
      <name>ПродажаПодаркаПодарочныйСертификат</name>
      <description>Продажа подарка «Подарочный сертификат»</description>
    </items>
    <items>
      <name>РеализацияТоваров</name>
      <description>Реализация товаров</description>
    </items>
    <items>
      <name>СборкаТоваровПодЗаказПокупателя</name>
      <description>Сборка товаров под заказ покупателя</description>
    </items>
    <items>
      <name>СписаниеНаЗатраты</name>
      <description>Списание на затраты</description>
    </items>
    <items>
      <name>СкидкиПодарки</name>
      <description>Списание на затраты (подарки)</description>
    </items>
    <items>
      <name>СписаниеПоИнвентаризации</name>
      <description>Списание по инвентаризации</description>
    </items>
    <items>
      <name>СписаниеПоИнвентаризацииСамостоятельной</name>
      <description>Списание по инвентаризации самостоятельной</description>
    </items>
  </predefined>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Склады/Склады.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Склады</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>IDN</name>
    <comment>NAV: Код склада в Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИзменения</name>
    <comment>NAV: timestamp</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеСклада</name>
    <type>
      <types>EnumRef.НазначенияСкладов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отдел</name>
    <comment>Соответствие организациям в Navision</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСклада</name>
    <type>
      <types>EnumRef.ТипыСкладов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Область</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/МаркетинговыеАкцииСерверПривилегированный/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Общая процедура проверки реализации и погашения серийных номеров
//
// Параметры
//  ДокументОбъект - объект проводимого документа документа.
//  РежимПроведения - режим проведения документа
//  Отказ - Переменная отвечающая за прерывание проведения
//  Заголовок - Заголовок при ошибке
//
Процедура ПроверитьДвиженияСерийныхНомеровДляПогашения(
	ДокументОбъект,
	ЭтоДокумент,
	ЭтоНовый,
	ТабличнаяЧасть,
	ТабличнаяЧасть_ПогашениеПодарочныхСертификатов,
	Отказ,
	ТекстОшибки = "",
	Дата
	) Экспорт

	Возврат;	//	LNK 30.05.2020 13:04:52

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СерийныеНомера.СерийныйНомер КАК Справочник.СерийныеНомера) КАК СерийныйНомер,
	|	СерийныеНомера.НомерСтроки
	|ПОМЕСТИТЬ ТабСерийныеНомераВсе
	|ИЗ
	|	&СерийныеНомера КАК СерийныеНомера
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСерийныеНомераВсе.СерийныйНомер КАК СерийныйНомер,
	|	ТабСерийныеНомераВсе.НомерСтроки
	|ПОМЕСТИТЬ ТабСерийныеНомера
	|ИЗ
	|	ТабСерийныеНомераВсе КАК ТабСерийныеНомераВсе
	|ГДЕ
	|	(НЕ ТабСерийныеНомераВсе.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ДвиженияСерийныхНомеров.АналитикаХозяйственнойОперации,
	|	ДвиженияСерийныхНомеров.Период КАК ДатаОперации,
	|	ДвиженияСерийныхНомеров.Получатель.Магазин КАК Магазин,
	|	ДвиженияСерийныхНомеров.Регистратор,
	|	ДвиженияСерийныхНомеров.СерийныйНомер
	|ПОМЕСТИТЬ ДвиженияСерийныхНомеров
	|ИЗ
	|	РегистрСведений.ДвиженияСерийныхНомеров КАК ДвиженияСерийныхНомеров
	|ГДЕ
	|	ДвиженияСерийныхНомеров.Период < &Дата
	|	И &УсловиеПоРегистратору
	|	И ДвиженияСерийныхНомеров.СерийныйНомер В
	|			(ВЫБРАТЬ
	|				ТабСерийныеНомера.СерийныйНомер
	|			ИЗ
	|				ТабСерийныеНомера КАК ТабСерийныеНомера)
	|	И ДвиженияСерийныхНомеров.АналитикаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.АналитикаХозяйственныхОпераций.ПогашениеПодарочныхСертификатов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ДвиженияСерийныхНомеров.АналитикаХозяйственнойОперации,
	|	ДвиженияСерийныхНомеров.ДатаОперации КАК ДатаОперации,
	|	ДвиженияСерийныхНомеров.Магазин КАК Магазин,
	|	ТабСерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|	ТабСерийныеНомера.СерийныйНомер.Владелец КАК Номенклатура,
	|	ТабСерийныеНомера.НомерСтроки
	|ИЗ
	|	ТабСерийныеНомера КАК ТабСерийныеНомера
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияСерийныхНомеров КАК ДвиженияСерийныхНомеров
	|		ПО ТабСерийныеНомера.СерийныйНомер = ДвиженияСерийныхНомеров.СерийныйНомер";
	
	Запрос.УстановитьПараметр("СерийныеНомера", ТабличнаяЧасть);
	
	Если ЭтоДокумент Тогда 
		Запрос.УстановитьПараметр("Регистратор", ДокументОбъект.Ссылка);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоРегистратору", "ДвиженияСерийныхНомеров.Регистратор <> &Регистратор");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоРегистратору", "ИСТИНА");
	КонецЕсли;
	Запрос.УстановитьПараметр("Дата", Дата);
	
	
	Результат = Запрос.Выполнить();
	ТаблицаЗапроса = Результат.Выгрузить();
	
	Для каждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Номер подарочного сертификата %1 уже погашен. В магазине %2 Дата %3'"),
			СтрокаТаблицыЗапроса.СерийныйНомер,
			СтрокаТаблицыЗапроса.Магазин,
			Формат(СтрокаТаблицыЗапроса.ДатаОперации, "ДФ=dd.MM.yyyy")
		);
		
		Если ЭтоДокумент Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДокументОбъект,
				,
				,
				Отказ
			);
		Иначе
			Отказ = Истина;
		КонецЕсли;
		
		ТекстОшибки = ТекстОшибки + Символы.ПС + Текст;
		
	КонецЦикла;
	
	ПогашенныеСерийныеНомера = ТаблицаЗапроса.ВыгрузитьКолонку("СерийныйНомер");

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СерийныеНомера.СерийныйНомер КАК Справочник.СерийныеНомера) КАК СерийныйНомер,
	|	СерийныеНомера.НомерСтроки
	|ПОМЕСТИТЬ ТабСерийныеНомераВсе
	|ИЗ
	|	&СерийныеНомера КАК СерийныеНомера
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСерийныеНомераВсе.СерийныйНомер КАК СерийныйНомер,
	|	ТабСерийныеНомераВсе.НомерСтроки
	|ПОМЕСТИТЬ ТабСерийныеНомера
	|ИЗ
	|	ТабСерийныеНомераВсе КАК ТабСерийныеНомераВсе
	|ГДЕ
	|	(НЕ ТабСерийныеНомераВсе.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка))
	|	И (НЕ ТабСерийныеНомераВсе.СерийныйНомер В (&ПогашенныеСерийныеНомера))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ДвиженияСерийныхНомеров.АналитикаХозяйственнойОперации,
	|	ДвиженияСерийныхНомеров.Период КАК ДатаОперации,
	|	ДвиженияСерийныхНомеров.Регистратор,
	|	ДвиженияСерийныхНомеров.Получатель.Магазин КАК Магазин,
	|	ДвиженияСерийныхНомеров.СерийныйНомер
	|ПОМЕСТИТЬ ДвиженияСерийныхНомеров
	|ИЗ
	|	РегистрСведений.ДвиженияСерийныхНомеров КАК ДвиженияСерийныхНомеров
	|ГДЕ
	|	ДвиженияСерийныхНомеров.Период < &Дата
	|	И &УсловиеПоРегистратору
	|	И ДвиженияСерийныхНомеров.СерийныйНомер В
	|			(ВЫБРАТЬ
	|				ТабСерийныеНомера.СерийныйНомер
	|			ИЗ
	|				ТабСерийныеНомера КАК ТабСерийныеНомера)
	|	И ДвиженияСерийныхНомеров.АналитикаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.АналитикаХозяйственныхОпераций.РеализацияТоваров)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ДвиженияСерийныхНомеров.АналитикаХозяйственнойОперации,
	|	ДвиженияСерийныхНомеров.ДатаОперации КАК ДатаОперации,
	|	ДвиженияСерийныхНомеров.Магазин КАК Магазин,
	|	ТабСерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|	ТабСерийныеНомера.СерийныйНомер.Владелец КАК Номенклатура,
	|	ТабСерийныеНомера.НомерСтроки
	|ИЗ
	|	ТабСерийныеНомера КАК ТабСерийныеНомера
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияСерийныхНомеров КАК ДвиженияСерийныхНомеров
	|		ПО ТабСерийныеНомера.СерийныйНомер = ДвиженияСерийныхНомеров.СерийныйНомер
	|ГДЕ
	|	ДвиженияСерийныхНомеров.АналитикаХозяйственнойОперации ЕСТЬ NULL "
	);
	
	Запрос.УстановитьПараметр("СерийныеНомера", ТабличнаяЧасть_ПогашениеПодарочныхСертификатов);
	Запрос.УстановитьПараметр("ПогашенныеСерийныеНомера", ПогашенныеСерийныеНомера);
	
	Если ЭтоДокумент Тогда 
		Запрос.УстановитьПараметр("Регистратор", ДокументОбъект.Ссылка);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоРегистратору", "ДвиженияСерийныхНомеров.Регистратор <> &Регистратор");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоРегистратору", "ИСТИНА");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗапроса = Результат.Выгрузить();
	
	Для каждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Номер подарочного сертификата %1 еще не был реализован.'"),
			СтрокаТаблицыЗапроса.СерийныйНомер
		);

		Если ЭтоДокумент Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДокументОбъект,
				,
				,
				Отказ
			);
		Иначе
			Отказ = Истина;
		КонецЕсли;
		
		ТекстОшибки = ТекстОшибки + Символы.ПС + Текст;
		
	КонецЦикла;

	НеРеализованныеСерийныеНомера = ТаблицаЗапроса.ВыгрузитьКолонку("СерийныйНомер");

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СерийныеНомера.СерийныйНомер КАК Справочник.СерийныеНомера) КАК СерийныйНомер,
	|	СерийныеНомера.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(СерийныеНомера.ПодарочныйСертификат КАК Справочник.Номенклатура) КАК ПодарочныйСертификат
	|ПОМЕСТИТЬ ТабСерийныеНомераВсе
	|ИЗ
	|	&СерийныеНомера КАК СерийныеНомера
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСерийныеНомераВсе.СерийныйНомер КАК СерийныйНомер,
	|	ТабСерийныеНомераВсе.НомерСтроки КАК НомерСтроки,
	|	ТабСерийныеНомераВсе.ПодарочныйСертификат КАК ПодарочныйСертификат
	|ПОМЕСТИТЬ ТабСерийныеНомера
	|ИЗ
	|	ТабСерийныеНомераВсе КАК ТабСерийныеНомераВсе
	|ГДЕ
	|	НЕ ТабСерийныеНомераВсе.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
	|	И НЕ ТабСерийныеНомераВсе.СерийныйНомер В (&ПогашенныеСерийныеНомера)
	|	И НЕ ТабСерийныеНомераВсе.СерийныйНомер В (&НеРеализованныеСерийныеНомера)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСерийныеНомераВсе.НомерСтроки КАК НомерСтроки,
	|	ТабСерийныеНомераВсе.ПодарочныйСертификат КАК ПодарочныйСертификат
	|ПОМЕСТИТЬ ТабБезСерийных
	|ИЗ
	|	ТабСерийныеНомераВсе КАК ТабСерийныеНомераВсе
	|ГДЕ
	|	НЕ ТабСерийныеНомераВсе.ПодарочныйСертификат.ИспользоватьСерийныеНомера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабСерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|	ТабСерийныеНомера.НомерСтроки КАК НомерСтроки,
	|	ТабСерийныеНомера.ПодарочныйСертификат.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	NULL КАК Магазин,
	|	NULL КАК ДатаОперации,
	|	ЛОЖЬ КАК СрокОтПродажи,
	|	ТабСерийныеНомера.ПодарочныйСертификат КАК Номенклатура
	|ПОМЕСТИТЬ НеПравильныеСерийныеНомера
	|ИЗ
	|	ТабСерийныеНомера КАК ТабСерийныеНомера
	|ГДЕ
	|	ТабСерийныеНомера.ПодарочныйСертификат.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.СОграничениемНаДату)
	|	И КОНЕЦПЕРИОДА(ТабСерийныеНомера.ПодарочныйСертификат.ДатаОкончанияДействия, ДЕНЬ) < &Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Ведущая.СерийныйНомер,
	|	Ведущая.НомерСтроки,
	|	ВЫБОР
	|		КОГДА Ведущая.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеров.Период, НЕДЕЛЯ, Ведущая.КоличествоПериодовДействия)
	|		КОГДА Ведущая.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеров.Период, ДЕКАДА, Ведущая.КоличествоПериодовДействия)
	|		КОГДА Ведущая.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеров.Период, МЕСЯЦ, Ведущая.КоличествоПериодовДействия)
	|		КОГДА Ведущая.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеров.Период, КВАРТАЛ, Ведущая.КоличествоПериодовДействия)
	|		КОГДА Ведущая.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеров.Период, ПОЛУГОДИЕ, Ведущая.КоличествоПериодовДействия)
	|		КОГДА Ведущая.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеров.Период, ГОД, Ведущая.КоличествоПериодовДействия)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеров.Период, ДЕНЬ, Ведущая.КоличествоПериодовДействия)
	|	КОНЕЦ,
	|	ДвиженияСерийныхНомеров.Отправитель.Магазин,
	|	ДвиженияСерийныхНомеров.Период,
	|	ИСТИНА,
	|	Ведущая.Номенклатура
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТабСерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|		ТабСерийныеНомера.НомерСтроки КАК НомерСтроки,
	|		ТабСерийныеНомера.ПодарочныйСертификат.Периодичность КАК Периодичность,
	|		ТабСерийныеНомера.ПодарочныйСертификат.КоличествоПериодовДействия КАК КоличествоПериодовДействия,
	|		ТабСерийныеНомера.ПодарочныйСертификат КАК Номенклатура
	|	ИЗ
	|		ТабСерийныеНомера КАК ТабСерийныеНомера
	|	ГДЕ
	|		ТабСерийныеНомера.СерийныйНомер.Владелец.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.ПериодПослеПродажи)) КАК Ведущая
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДвиженияСерийныхНомеров.СрезПоследних(
	|				&ДатаДвижений,
	|				СерийныйНомер В
	|						(ВЫБРАТЬ
	|							ТабСерийныеНомера.СерийныйНомер
	|						ИЗ
	|							ТабСерийныеНомера КАК ТабСерийныеНомера
	|						ГДЕ
	|							ТабСерийныеНомера.СерийныйНомер.Владелец.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.ПериодПослеПродажи))
	|					И АналитикаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.АналитикаХозяйственныхОпераций.РеализацияТоваров)) КАК ДвиженияСерийныхНомеров
	|		ПО Ведущая.СерийныйНомер = ДвиженияСерийныхНомеров.СерийныйНомер
	|ГДЕ
	|	ВЫБОР
	|			КОГДА Ведущая.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Неделя)
	|				ТОГДА ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеров.Период, НЕДЕЛЯ, Ведущая.КоличествоПериодовДействия)
	|			КОГДА Ведущая.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Декада)
	|				ТОГДА ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеров.Период, ДЕКАДА, Ведущая.КоличествоПериодовДействия)
	|			КОГДА Ведущая.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|				ТОГДА ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеров.Период, МЕСЯЦ, Ведущая.КоличествоПериодовДействия)
	|			КОГДА Ведущая.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Квартал)
	|				ТОГДА ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеров.Период, КВАРТАЛ, Ведущая.КоличествоПериодовДействия)
	|			КОГДА Ведущая.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Полугодие)
	|				ТОГДА ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеров.Период, ПОЛУГОДИЕ, Ведущая.КоличествоПериодовДействия)
	|			КОГДА Ведущая.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Год)
	|				ТОГДА ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеров.Период, ГОД, Ведущая.КоличествоПериодовДействия)
	|			ИНАЧЕ ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеров.Период, ДЕНЬ, Ведущая.КоличествоПериодовДействия)
	|		КОНЕЦ < &Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	ТабБезСерийных.НомерСтроки,
	|	ТабБезСерийных.ПодарочныйСертификат.ДатаОкончанияДействия,
	|	NULL,
	|	NULL,
	|	ЛОЖЬ,
	|	ТабБезСерийных.ПодарочныйСертификат
	|ИЗ
	|	ТабБезСерийных КАК ТабБезСерийных
	|ГДЕ
	|	КОНЕЦПЕРИОДА(ТабБезСерийных.ПодарочныйСертификат.ДатаОкончанияДействия, ДЕНЬ) < &Дата
	|	И ТабБезСерийных.ПодарочныйСертификат.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.СОграничениемНаДату)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НеПравильныеСерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|	НеПравильныеСерийныеНомера.НомерСтроки КАК НомерСтроки,
	|	НеПравильныеСерийныеНомера.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	НеПравильныеСерийныеНомера.Магазин КАК Магазин,
	|	НеПравильныеСерийныеНомера.ДатаОперации КАК ДатаОперации,
	|	НеПравильныеСерийныеНомера.СрокОтПродажи КАК СрокОтПродажи,
	|	НеПравильныеСерийныеНомера.Номенклатура КАК Номенклатура
	|ИЗ
	|	НеПравильныеСерийныеНомера КАК НеПравильныеСерийныеНомера";
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаДвижений", КонецДня(Дата));
	Запрос.УстановитьПараметр("ПогашенныеСерийныеНомера", ПогашенныеСерийныеНомера);
	Запрос.УстановитьПараметр("НеРеализованныеСерийныеНомера", НеРеализованныеСерийныеНомера);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗапроса = Результат.Выгрузить();
	
	Для каждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицыЗапроса.СерийныйНомер) Тогда
			
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Номер подарочного сертификата: %1 закончился срок действия - %2'"),
				СтрокаТаблицыЗапроса.СерийныйНомер,
				Формат(СтрокаТаблицыЗапроса.ДатаОкончанияДействия, "ДФ=dd.MM.yyyy")
			);
			
		Иначе
			
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Подарочный сертификат: %1 закончился срок действия - %2'"),
				СтрокаТаблицыЗапроса.Номенклатура,
				Формат(СтрокаТаблицыЗапроса.ДатаОкончанияДействия, "ДФ=dd.MM.yyyy")
			);
			
		КонецЕсли;
		
		Если СтрокаТаблицыЗапроса.СрокОтПродажи Тогда
			
			Текст = Текст + Символы.ПС +
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = ' реализация была в магазине %1 Дата %2'"),
					СтрокаТаблицыЗапроса.Магазин,
					Формат(СтрокаТаблицыЗапроса.ДатаОперации, "ДФ=dd.MM.yyyy")
					);
			
		КонецЕсли;
		
		Если ЭтоДокумент Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДокументОбъект,
				,
				,
				Отказ
			);
		Иначе
			Отказ = Истина;
		КонецЕсли;
		
		ТекстОшибки = ТекстОшибки + Символы.ПС + Текст;

	КонецЦикла;

КонецПроцедуры

// +HVOYA. 30.08.2016 17:06:10, Львова Е.А.
Процедура hiПроверитьДвиженияСерийныхНомеровКупонов(ДокументОбъект, ЭтоДокумент, ЭтоНовый, ТаблицаЗначений_Товары, ИмяТабличнойЧасти, ТаблицаЗначений_СерийныеНомера,
	 		Отказ, ТекстОшибки = "", Дата = Неопределено, ЭтоПогашениеКупона) Экспорт

	Если НЕ ПривилегированныйРежим() Тогда

		УстановитьПривилегированныйРежим(Истина);

	КонецЕсли;
	
	Для каждого Строка Из ТаблицаЗначений_Товары Цикл	//	LNK 16.06.2020 07:22:47 Нужно переписать по ключу "Строка.ТипНоменклатуры"

		ДанныеНоменклатуры = ЗапасыПовтИсп.ДанныеНоменклатуры(Строка.Номенклатура);

		Если НЕ ДанныеНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.СкидочныйКупон Тогда

			Продолжить

		КонецЕсли;
		
		Если ДанныеНоменклатуры.ИспользоватьСерийныеНомера Тогда

			ОтборПоСН = Новый Структура("КлючСвязиСерийныхНомеров", Строка.КлючСвязиСерийныхНомеров); 
			МассивСтрок = ТаблицаЗначений_СерийныеНомера.НайтиСтроки(ОтборПоСН);

			Если МассивСтрок.Количество() = 0 Тогда

				Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Серийный номер скидочного купона номенклатуры ""%1"" (строка №%2) , не найден!'"), СокрЛП(ДанныеНоменклатуры.Номенклатура), Строка.НомерСтроки);
				ТекстОшибки = ТекстОшибки + Символы.ПС + Текст + Символы.ПС;

				Отказ = Истина;
				Продолжить;

			КонецЕсли; 

			СерийныйНомер = МассивСтрок[0].СерийныйНомер;
			
			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ТаблицаДвижений.Купон КАК Купон,
			|	ТаблицаДвижений.АналитикаХозяйственнойОперации КАК АналитикаХозяйственнойОперации,
			|	ТаблицаДвижений.ЧекККМ.Магазин КАК Магазин,
			|	ТаблицаДвижений.ЧекККМ.Дата КАК ДатаОперации
			|ИЗ
			|	РегистрСведений.ДвиженияСерийныхНомеровКупонов КАК ТаблицаДвижений
			|ГДЕ
			|	ТаблицаДвижений.Купон = &Купон
			|	И ТаблицаДвижений.СерийныйНомер = &СерийныйНомер"
			);
			Запрос.УстановитьПараметр("Купон", ДанныеНоменклатуры.Номенклатура);
			Запрос.УстановитьПараметр("СерийныйНомер", СерийныйНомер);
			
			Результат = Запрос.Выполнить();
			
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Если Выборка.АналитикаХозяйственнойОперации = Справочники.АналитикаХозяйственныхОпераций.РеализацияТоваров Тогда
					Отказ = Ложь;
				ИначеЕсли Выборка.АналитикаХозяйственнойОперации = Справочники.АналитикаХозяйственныхОпераций.ПогашениеПодарочныхСертификатов Тогда
					Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Номер скидочного купона %3 номенклатуры ""%1"" (строка №%2) уже погашен в магазине %4. Дата погашения - %5.'"), 
							Строка.Номенклатура, 
							Строка.НомерСтроки, 
							СерийныйНомер,
							// +HVOYA. 24.11.2016 14:00:29, Львова Е.А.
							Выборка.Магазин,
							Формат(Выборка.ДатаОперации, "ДФ=dd.MM.yyyy"));
							// -HVOYA. 24.11.2016 14:00:34, Львова Е.А.
					
					Текст = Текст + Символы.ПС;
					ТекстОшибки = ТекстОшибки + Символы.ПС + Текст;
					Отказ = Истина;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура hiПроверитьДвиженияСерийныхНомеровДляПогашенияКупонов(
	ДокументОбъект,
	ЭтоДокумент,
	ЭтоНовый,
	ТабличнаяЧасть,
	ТабличнаяЧасть_ПогашениеСкидочныхКупонов,
	Отказ,
	ТекстОшибки = "",
	Дата
	) Экспорт
	
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СерийныеНомера.СерийныйНомер КАК Справочник.СерийныеНомера) КАК СерийныйНомер,
	|	СерийныеНомера.НомерСтроки
	|ПОМЕСТИТЬ ТабСерийныеНомераВсе
	|ИЗ
	|	&СерийныеНомера КАК СерийныеНомера
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСерийныеНомераВсе.СерийныйНомер КАК СерийныйНомер,
	|	ТабСерийныеНомераВсе.НомерСтроки
	|ПОМЕСТИТЬ ТабСерийныеНомера
	|ИЗ
	|	ТабСерийныеНомераВсе КАК ТабСерийныеНомераВсе
	|ГДЕ
	|	(НЕ ТабСерийныеНомераВсе.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка)
	|	И НЕ ТабСерийныеНомераВсе.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ДвиженияСерийныхНомеров.АналитикаХозяйственнойОперации,
	|	ДвиженияСерийныхНомеров.Период КАК ДатаОперации,
	|	ДвиженияСерийныхНомеров.Получатель.Магазин КАК Магазин,
	|	ДвиженияСерийныхНомеров.Регистратор,
	|	ДвиженияСерийныхНомеров.СерийныйНомер
	|ПОМЕСТИТЬ ДвиженияСерийныхНомеров
	|ИЗ
	|	РегистрСведений.ДвиженияСерийныхНомеров КАК ДвиженияСерийныхНомеров
	|ГДЕ
	|	ДвиженияСерийныхНомеров.Период < &Дата
	|	И &УсловиеПоРегистратору
	|	И ДвиженияСерийныхНомеров.СерийныйНомер В
	|			(ВЫБРАТЬ
	|				ТабСерийныеНомера.СерийныйНомер
	|			ИЗ
	|				ТабСерийныеНомера КАК ТабСерийныеНомера)
	|	И ДвиженияСерийныхНомеров.АналитикаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.АналитикаХозяйственныхОпераций.ПогашениеПодарочныхСертификатов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ДвиженияСерийныхНомеров.АналитикаХозяйственнойОперации,
	|	ДвиженияСерийныхНомеров.ДатаОперации КАК ДатаОперации,
	|	ДвиженияСерийныхНомеров.Магазин КАК Магазин,
	|	ТабСерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|	ТабСерийныеНомера.СерийныйНомер.Владелец КАК Номенклатура,
	|	ТабСерийныеНомера.НомерСтроки
	|ИЗ
	|	ТабСерийныеНомера КАК ТабСерийныеНомера
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияСерийныхНомеров КАК ДвиженияСерийныхНомеров
	|		ПО ТабСерийныеНомера.СерийныйНомер = ДвиженияСерийныхНомеров.СерийныйНомер";
	
	Запрос.УстановитьПараметр("СерийныеНомера", ТабличнаяЧасть_ПогашениеСкидочныхКупонов);
	
	Если ЭтоДокумент Тогда 
		Запрос.УстановитьПараметр("Регистратор", ДокументОбъект.Ссылка);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоРегистратору", "ДвиженияСерийныхНомеров.Регистратор <> &Регистратор");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоРегистратору", "ИСТИНА");
	КонецЕсли;
	Запрос.УстановитьПараметр("Дата", Дата);
	
	
	Результат = Запрос.Выполнить();
	ТаблицаЗапроса = Результат.Выгрузить();
	
	Для каждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Номер скидочного купона %1 уже погашен. В магазине %2 Дата %3'"),
			СтрокаТаблицыЗапроса.СерийныйНомер,
			СтрокаТаблицыЗапроса.Магазин,
			Формат(СтрокаТаблицыЗапроса.ДатаОперации, "ДФ=dd.MM.yyyy")
		);
		
		Если ЭтоДокумент Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДокументОбъект,
				,
				,
				Отказ
			);
		Иначе
			Отказ = Истина;
		КонецЕсли;
		
		ТекстОшибки = ТекстОшибки + Символы.ПС + Текст;
		
	КонецЦикла;
	
	ПогашенныеСерийныеНомера = ТаблицаЗапроса.ВыгрузитьКолонку("СерийныйНомер");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СерийныеНомера.СерийныйНомер КАК Справочник.СерийныеНомера) КАК СерийныйНомер,
	|	СерийныеНомера.НомерСтроки
	|ПОМЕСТИТЬ ТабСерийныеНомераВсе
	|ИЗ
	|	&СерийныеНомера КАК СерийныеНомера
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСерийныеНомераВсе.СерийныйНомер КАК СерийныйНомер,
	|	ТабСерийныеНомераВсе.НомерСтроки
	|ПОМЕСТИТЬ ТабСерийныеНомера
	|ИЗ
	|	ТабСерийныеНомераВсе КАК ТабСерийныеНомераВсе
	|ГДЕ
	|	(НЕ ТабСерийныеНомераВсе.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка))
	|	И (НЕ ТабСерийныеНомераВсе.СерийныйНомер В (&ПогашенныеСерийныеНомера))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ДвиженияСерийныхНомеров.АналитикаХозяйственнойОперации,
	|	ДвиженияСерийныхНомеров.Период КАК ДатаОперации,
	|	ДвиженияСерийныхНомеров.Регистратор,
	|	ДвиженияСерийныхНомеров.Получатель.Магазин КАК Магазин,
	|	ДвиженияСерийныхНомеров.СерийныйНомер
	|ПОМЕСТИТЬ ДвиженияСерийныхНомеров
	|ИЗ
	|	РегистрСведений.ДвиженияСерийныхНомеров КАК ДвиженияСерийныхНомеров
	|ГДЕ
	|	ДвиженияСерийныхНомеров.Период < &Дата
	|	И &УсловиеПоРегистратору
	|	И ДвиженияСерийныхНомеров.СерийныйНомер В
	|			(ВЫБРАТЬ
	|				ТабСерийныеНомера.СерийныйНомер
	|			ИЗ
	|				ТабСерийныеНомера КАК ТабСерийныеНомера)
	|	И ДвиженияСерийныхНомеров.АналитикаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.АналитикаХозяйственныхОпераций.РеализацияТоваров)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ 
	|	ДвиженияСерийныхНомеров.АналитикаХозяйственнойОперации,
	|	ДвиженияСерийныхНомеров.ДатаОперации КАК ДатаОперации,
	|	ДвиженияСерийныхНомеров.Магазин КАК Магазин,
	|	ТабСерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|	ТабСерийныеНомера.СерийныйНомер.Владелец КАК Номенклатура,
	|	ТабСерийныеНомера.НомерСтроки
	|ИЗ
	|	ТабСерийныеНомера КАК ТабСерийныеНомера
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияСерийныхНомеров КАК ДвиженияСерийныхНомеров
	|		ПО ТабСерийныеНомера.СерийныйНомер = ДвиженияСерийныхНомеров.СерийныйНомер
	|ГДЕ
	|	ДвиженияСерийныхНомеров.АналитикаХозяйственнойОперации ЕСТЬ NULL ";
	
	Запрос.УстановитьПараметр("СерийныеНомера", ТабличнаяЧасть_ПогашениеСкидочныхКупонов);
	Запрос.УстановитьПараметр("ПогашенныеСерийныеНомера", ПогашенныеСерийныеНомера);
	
	Если ЭтоДокумент Тогда 
		Запрос.УстановитьПараметр("Регистратор", ДокументОбъект.Ссылка);
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоРегистратору", "ДвиженияСерийныхНомеров.Регистратор <> &Регистратор");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеПоРегистратору", "ИСТИНА");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗапроса = Результат.Выгрузить();
	
	Для каждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
		
		Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Номер скидочного купона %1 еще не был реализован.'"),
			СтрокаТаблицыЗапроса.СерийныйНомер
		);
		
		
		Если ЭтоДокумент Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДокументОбъект,
				,
				,
				Отказ
			);
		Иначе
			Отказ = Истина;
		КонецЕсли;
		
		ТекстОшибки = ТекстОшибки + Символы.ПС + Текст;
		
	КонецЦикла;

	НеРеализованныеСерийныеНомера = ТаблицаЗапроса.ВыгрузитьКолонку("СерийныйНомер");
	
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(СерийныеНомера.СерийныйНомер КАК Справочник.СерийныеНомера) КАК СерийныйНомер,
	|	СерийныеНомера.НомерСтроки,
	|	ВЫРАЗИТЬ(СерийныеНомера.СкидочныйКупон КАК Справочник.Номенклатура) КАК СкидочныйКупон
	|ПОМЕСТИТЬ ТабСерийныеНомераВсе
	|ИЗ
	|	&СерийныеНомера КАК СерийныеНомера
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСерийныеНомераВсе.СерийныйНомер КАК СерийныйНомер,
	|	ТабСерийныеНомераВсе.НомерСтроки,
	|	ТабСерийныеНомераВсе.СкидочныйКупон
	|ПОМЕСТИТЬ ТабСерийныеНомера
	|ИЗ
	|	ТабСерийныеНомераВсе КАК ТабСерийныеНомераВсе
	|ГДЕ
	|	(НЕ ТабСерийныеНомераВсе.СерийныйНомер = ЗНАЧЕНИЕ(Справочник.СерийныеНомера.ПустаяСсылка))
	|	И (НЕ ТабСерийныеНомераВсе.СерийныйНомер В (&ПогашенныеСерийныеНомера))
	|	И (НЕ ТабСерийныеНомераВсе.СерийныйНомер В (&НеРеализованныеСерийныеНомера))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабСерийныеНомераВсе.НомерСтроки,
	|	ТабСерийныеНомераВсе.СкидочныйКупон
	|ПОМЕСТИТЬ ТабБезСерийных
	|ИЗ
	|	ТабСерийныеНомераВсе КАК ТабСерийныеНомераВсе
	|ГДЕ
	|	(НЕ ТабСерийныеНомераВсе.СкидочныйКупон.ИспользоватьСерийныеНомера)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТабСерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|	ТабСерийныеНомера.НомерСтроки,
	|	ТабСерийныеНомера.СкидочныйКупон.ДатаОкончанияДействия КАК ДатаОкончанияДействия,
	|	NULL КАК Магазин,
	|	NULL КАК ДатаОперации,
	|	ЛОЖЬ КАК СрокОтПродажи,
	|	ТабСерийныеНомера.СкидочныйКупон КАК Номенклатура
	|ПОМЕСТИТЬ НеПравильныеСерийныеНомера
	|ИЗ
	|	ТабСерийныеНомера КАК ТабСерийныеНомера
	|ГДЕ
	|	ТабСерийныеНомера.СкидочныйКупон.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.СОграничениемНаДату)
	|	И КОНЕЦПЕРИОДА(ТабСерийныеНомера.СкидочныйКупон.ДатаОкончанияДействия, ДЕНЬ) < &Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.СерийныйНомер,
	|	ВложенныйЗапрос.НомерСтроки,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|			ТОГДА ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеровСрезПоследних.Период, МЕСЯЦ, ВложенныйЗапрос.КоличествоПериодовДействия)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеровСрезПоследних.Период, ДЕНЬ, ВложенныйЗапрос.КоличествоПериодовДействия)
	|	КОНЕЦ,
	|	ДвиженияСерийныхНомеровСрезПоследних.Отправитель.Магазин,
	|	ДвиженияСерийныхНомеровСрезПоследних.Период,
	|	ИСТИНА,
	|	ВложенныйЗапрос.Номенклатура
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТабСерийныеНомера.СерийныйНомер КАК СерийныйНомер,
	|		ТабСерийныеНомера.НомерСтроки КАК НомерСтроки,
	|		ТабСерийныеНомера.СкидочныйКупон.Периодичность КАК Периодичность,
	|		ТабСерийныеНомера.СкидочныйКупон.КоличествоПериодовДействия КАК КоличествоПериодовДействия,
	|		ТабСерийныеНомера.СкидочныйКупон КАК Номенклатура
	|	ИЗ
	|		ТабСерийныеНомера КАК ТабСерийныеНомера
	|	ГДЕ
	|		ТабСерийныеНомера.СерийныйНомер.Владелец.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.ПериодПослеПродажи)) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДвиженияСерийныхНомеров.СрезПоследних(
	|				&ДатаДвижений,
	|				СерийныйНомер В
	|						(ВЫБРАТЬ
	|							ТабСерийныеНомера.СерийныйНомер
	|						ИЗ
	|							ТабСерийныеНомера КАК ТабСерийныеНомера
	|						ГДЕ
	|							ТабСерийныеНомера.СерийныйНомер.Владелец.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.ПериодПослеПродажи))
	|					И АналитикаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.АналитикаХозяйственныхОпераций.РеализацияТоваров)) КАК ДвиженияСерийныхНомеровСрезПоследних
	|		ПО ВложенныйЗапрос.СерийныйНомер = ДвиженияСерийныхНомеровСрезПоследних.СерийныйНомер
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ВложенныйЗапрос.Периодичность = ЗНАЧЕНИЕ(Перечисление.Периодичность.Месяц)
	|				ТОГДА ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеровСрезПоследних.Период, МЕСЯЦ, ВложенныйЗапрос.КоличествоПериодовДействия)
	|			ИНАЧЕ ДОБАВИТЬКДАТЕ(ДвиженияСерийныхНомеровСрезПоследних.Период, ДЕНЬ, ВложенныйЗапрос.КоличествоПериодовДействия)
	|		КОНЕЦ < &Дата
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	ТабБезСерийных.НомерСтроки,
	|	ТабБезСерийных.СкидочныйКупон.ДатаОкончанияДействия,
	|	NULL,
	|	NULL,
	|	ЛОЖЬ,
	|	ТабБезСерийных.СкидочныйКупон
	|ИЗ
	|	ТабБезСерийных КАК ТабБезСерийных
	|ГДЕ
	|	КОНЕЦПЕРИОДА(ТабБезСерийных.СкидочныйКупон.ДатаОкончанияДействия, ДЕНЬ) < &Дата
	|	И ТабБезСерийных.СкидочныйКупон.ТипСрокаДействия = ЗНАЧЕНИЕ(Перечисление.СрокДействияПодарочныхСертификатов.СОграничениемНаДату)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СерийныйНомер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НеПравильныеСерийныеНомера.СерийныйНомер,
	|	НеПравильныеСерийныеНомера.НомерСтроки,
	|	НеПравильныеСерийныеНомера.ДатаОкончанияДействия,
	|	НеПравильныеСерийныеНомера.Магазин,
	|	НеПравильныеСерийныеНомера.ДатаОперации,
	|	НеПравильныеСерийныеНомера.СрокОтПродажи,
	|	НеПравильныеСерийныеНомера.Номенклатура
	|ИЗ
	|	НеПравильныеСерийныеНомера КАК НеПравильныеСерийныеНомера";

	
	Запрос.УстановитьПараметр("Дата", НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаДвижений", КонецДня(Дата));
	Запрос.УстановитьПараметр("ПогашенныеСерийныеНомера", ПогашенныеСерийныеНомера);
	Запрос.УстановитьПараметр("НеРеализованныеСерийныеНомера", НеРеализованныеСерийныеНомера);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗапроса = Результат.Выгрузить();
	
	Для каждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
		
		Если ЗначениеЗаполнено(СтрокаТаблицыЗапроса.СерийныйНомер) Тогда
			
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Номер скидочного купона: %1 закончился срок действия - %2'"),
				СтрокаТаблицыЗапроса.СерийныйНомер,
				Формат(СтрокаТаблицыЗапроса.ДатаОкончанияДействия, "ДФ=dd.MM.yyyy")
			);
			
		Иначе
			
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Скидочный купон: %1 закончился срок действия - %2'"),
				СтрокаТаблицыЗапроса.Номенклатура,
				Формат(СтрокаТаблицыЗапроса.ДатаОкончанияДействия, "ДФ=dd.MM.yyyy")
			);
			
		КонецЕсли;
		
		Если СтрокаТаблицыЗапроса.СрокОтПродажи Тогда
			
			Текст = Текст + Символы.ПС +
						СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = ' реализация была в магазине %1 Дата %2'"),
					СтрокаТаблицыЗапроса.Магазин,
					Формат(СтрокаТаблицыЗапроса.ДатаОперации, "ДФ=dd.MM.yyyy")
					);
			
		КонецЕсли;
		
		Если ЭтоДокумент Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				Текст,
				ДокументОбъект,
				,
				,
				Отказ
			);
		Иначе
			Отказ = Истина;
		КонецЕсли;
		
		ТекстОшибки = ТекстОшибки + Символы.ПС + Текст;
		
	КонецЦикла;

КонецПроцедуры
// -HVOYA. 30.08.2016 17:06:17, Львова Е.А.

// Общая процедура Остатков серийных номеров
//
// Параметры
//  ДокументОбъект - объект проводимого документа документа.
//  ИмяТабличнойЧасти - Имя табличной части Товары
//  ИмяТабличнойЧастиСерийныеНомера - Имя табличной части Серийные номера
//  РежимПроведения - режим проведения документа
//  Отказ - Переменная отвечающая за прерывание проведения
//  Заголовок - Заголовок при ошибке
//  Дата - дата проверки
//
Процедура ПроверитьОстаткиСерийныхНомеров(
		ТаблицаЗначений_Товары, 
		ТаблицаЗначений_СерийныеНомера,
		Отказ,
		ТекстОшибки) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаТовары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТаблицаТовары.КлючСвязиСерийныхНомеров КАК ЧИСЛО(5, 0)) КАК КлючСвязиСерийныхНомеров,
	|	ВЫРАЗИТЬ(ТаблицаТовары.Склад КАК Справочник.Склады) КАК Склад
	|ПОМЕСТИТЬ ДокТовары
	|ИЗ
	|	&ТаблицаТовары КАК ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТаблицаСерийныхНомеров.СерийныйНомер КАК Справочник.СерийныеНомера) КАК СерийныйНомер,
	|	ВЫРАЗИТЬ(ТаблицаСерийныхНомеров.КлючСвязиСерийныхНомеров КАК ЧИСЛО(5, 0)) КАК КлючСвязиСерийныхНомеров
	|ПОМЕСТИТЬ ТаблицаСерийныхНомеров
	|ИЗ
	|	&ТаблицаСерийныхНомеров КАК ТаблицаСерийныхНомеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСерийныхНомеров.СерийныйНомер КАК СерийныйНомер,
	|	ДокТовары.Номенклатура КАК Номенклатура,
	|	ДокТовары.Склад КАК Склад
	|ПОМЕСТИТЬ ТаблицаСерийныхНомеровПолная
	|ИЗ
	|	ТаблицаСерийныхНомеров КАК ТаблицаСерийныхНомеров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокТовары КАК ДокТовары
	|		ПО ТаблицаСерийныхНомеров.КлючСвязиСерийныхНомеров = ДокТовары.КлючСвязиСерийныхНомеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.СерийныйНомер КАК СерийныйНомер,
	|	ВложенныйЗапрос.Склад КАК Склад,
	|	СУММА(ВложенныйЗапрос.Количество) КАК Количество
	|ПОМЕСТИТЬ ТаблицаОстатков
	|ИЗ
	|	(ВЫБРАТЬ
	|		ДвиженияСерийныхНомеров.Номенклатура КАК Номенклатура,
	|		ДвиженияСерийныхНомеров.СерийныйНомер КАК СерийныйНомер,
	|		ДвиженияСерийныхНомеров.Получатель КАК Склад,
	|		ДвиженияСерийныхНомеров.Количество КАК Количество
	|	ИЗ
	|		РегистрСведений.ДвиженияСерийныхНомеров КАК ДвиженияСерийныхНомеров
	|	ГДЕ
	|		(ДвиженияСерийныхНомеров.Номенклатура, ДвиженияСерийныхНомеров.СерийныйНомер, ДвиженияСерийныхНомеров.Получатель) В
	|				(ВЫБРАТЬ
	|					Таблица.Номенклатура,
	|					Таблица.СерийныйНомер,
	|					Таблица.Склад
	|				ИЗ
	|					ТаблицаСерийныхНомеровПолная КАК Таблица)
	|		И (НЕ ДвиженияСерийныхНомеров.АналитикаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.АналитикаХозяйственныхОпераций.ПогашениеПодарочныхСертификатов))
	|		И (НЕ ДвиженияСерийныхНомеров.Получатель = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ДвиженияСерийныхНомеров.Номенклатура,
	|		ДвиженияСерийныхНомеров.СерийныйНомер,
	|		ДвиженияСерийныхНомеров.Отправитель,
	|		-ДвиженияСерийныхНомеров.Количество
	|	ИЗ
	|		РегистрСведений.ДвиженияСерийныхНомеров КАК ДвиженияСерийныхНомеров
	|	ГДЕ
	|		(ДвиженияСерийныхНомеров.Номенклатура, ДвиженияСерийныхНомеров.СерийныйНомер, ДвиженияСерийныхНомеров.Отправитель) В
	|				(ВЫБРАТЬ
	|					Таблица.Номенклатура,
	|					Таблица.СерийныйНомер,
	|					Таблица.Склад
	|				ИЗ
	|					ТаблицаСерийныхНомеровПолная КАК Таблица)
	|		И (НЕ ДвиженияСерийныхНомеров.АналитикаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.АналитикаХозяйственныхОпераций.ПогашениеПодарочныхСертификатов))
	|		И (НЕ ДвиженияСерийныхНомеров.Отправитель = ЗНАЧЕНИЕ(Справочник.Склады.ПустаяСсылка))) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Склад,
	|	ВложенныйЗапрос.СерийныйНомер,
	|	ВложенныйЗапрос.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаСерийныхНомеровПолная.СерийныйНомер,
	|	ТаблицаСерийныхНомеровПолная.Номенклатура,
	|	ТаблицаСерийныхНомеровПолная.Склад
	|ИЗ
	|	ТаблицаСерийныхНомеровПолная КАК ТаблицаСерийныхНомеровПолная
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатков КАК ТаблицаОстатков
	|		ПО ТаблицаСерийныхНомеровПолная.СерийныйНомер = ТаблицаОстатков.СерийныйНомер
	|			И ТаблицаСерийныхНомеровПолная.Номенклатура = ТаблицаОстатков.Номенклатура
	|			И ТаблицаСерийныхНомеровПолная.Склад = ТаблицаОстатков.Склад
	|ГДЕ
	|	ЕСТЬNULL(ТаблицаОстатков.Количество, 0) <= 0";

	Запрос.УстановитьПараметр("ТаблицаТовары" , ТаблицаЗначений_Товары);
	Запрос.УстановитьПараметр("ТаблицаСерийныхНомеров" , ТаблицаЗначений_СерийныеНомера);
	ТаблицаПоОтрицательнымОстаткам = Запрос.Выполнить().Выгрузить();
	
	ШаблонСообщения = НСтр("ru = 'Номер подарочного сертификата %3 (%1) 
		|Отсутствует на складе %2'");
	
	Для каждого СтрокаТаблицы Из ТаблицаПоОтрицательнымОстаткам Цикл
		Отказ = Истина;
		ТекстОшибки = ТекстОшибки + Символы.ПС + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ШаблонСообщения,
			Строка(СтрокаТаблицы.Номенклатура),
			Строка(СтрокаТаблицы.Склад),
			Строка(СтрокаТаблицы.СерийныйНомер));
	КонецЦикла;
	
КонецПроцедуры //ПроверитьОстаткиСерийныхНомеров

// Функция получает таблицу серийных номеров
// Возвращаемое значение
//		ТаблицаЗапроса - ТаблицаЗначений - результат запроса, выгруженный в таблицу значений
Функция ПолучитьТаблицуСерийныхНомеров(МассивСерийныхНомеров, МассивИспользуемыхСерийныхНомеров, ЭтоРеализация, Дата) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СерийныеНомера.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ТабСерийныеНомера
	|ИЗ
	|	Справочник.СерийныеНомера КАК СерийныеНомера
	|ГДЕ
	|	СерийныеНомера.Ссылка В(&МассивСерийныхНомеров)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////";
	Если ЭтоРеализация Тогда
	
		Запрос.Текст = Запрос.Текст + Символы.ПС + 
		"ВЫБРАТЬ
		|	ДвиженияСерийныхНомеровСрезПоследних.СерийныйНомер
		|ПОМЕСТИТЬ ТабНеПравильныхСерийныхНомеров
		|ИЗ
		|	РегистрСведений.ДвиженияСерийныхНомеров.СрезПоследних(
		|			&Дата,
		|			СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ТабСерийныеНомера.Ссылка
		|					ИЗ
		|						ТабСерийныеНомера КАК ТабСерийныеНомера)
		|				И (АналитикаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.АналитикаХозяйственныхОпераций.РеализацияТоваров)
		|					ИЛИ АналитикаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.АналитикаХозяйственныхОпераций.ПогашениеПодарочныхСертификатов)
		|					ИЛИ АналитикаХозяйственнойОперации.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаЗатраты)
		|					ИЛИ АналитикаХозяйственнойОперации.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПоИнвентаризации))) КАК ДвиженияСерийныхНомеровСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабСерийныеНомера.Ссылка
		|ИЗ
		|	ТабСерийныеНомера КАК ТабСерийныеНомера
		|ГДЕ
		|	(НЕ ТабСерийныеНомера.Ссылка В
		|				(ВЫБРАТЬ
		|					ТабНеПравильныхСерийныхНомеров.СерийныйНомер
		|				ИЗ
		|					ТабНеПравильныхСерийныхНомеров КАК ТабНеПравильныхСерийныхНомеров))";
		
	Иначе
		Запрос.Текст = Запрос.Текст + Символы.ПС + 
		"ВЫБРАТЬ
		|	ДвиженияСерийныхНомеровСрезПоследних.СерийныйНомер
		|ПОМЕСТИТЬ ТабРеализованных
		|ИЗ
		|	РегистрСведений.ДвиженияСерийныхНомеров.СрезПоследних(
		|			&Дата,
		|			СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ТабСерийныеНомера.Ссылка
		|					ИЗ
		|						ТабСерийныеНомера КАК ТабСерийныеНомера)
		|				И (АналитикаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.АналитикаХозяйственныхОпераций.РеализацияТоваров)
		|					ИЛИ АналитикаХозяйственнойОперации.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаЗатраты)
		|					ИЛИ АналитикаХозяйственнойОперации.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПоИнвентаризации))) КАК ДвиженияСерийныхНомеровСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияСерийныхНомеровСрезПоследних.СерийныйНомер
		|ПОМЕСТИТЬ ТабПогашенныхИСписанных
		|ИЗ
		|	РегистрСведений.ДвиженияСерийныхНомеров.СрезПоследних(
		|			&Дата,
		|			СерийныйНомер В
		|					(ВЫБРАТЬ
		|						ТабСерийныеНомера.Ссылка
		|					ИЗ
		|						ТабСерийныеНомера КАК ТабСерийныеНомера)
		|				И (АналитикаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.АналитикаХозяйственныхОпераций.ПогашениеПодарочныхСертификатов)
		|					ИЛИ АналитикаХозяйственнойОперации.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаЗатраты)
		|					ИЛИ АналитикаХозяйственнойОперации.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПоИнвентаризации))) КАК ДвиженияСерийныхНомеровСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабСерийныеНомера.Ссылка
		|ИЗ
		|	ТабСерийныеНомера КАК ТабСерийныеНомера
		|ГДЕ
		|	(НЕ ТабСерийныеНомера.Ссылка В
		|				(ВЫБРАТЬ
		|					ТабПогашенныхИСписанных.СерийныйНомер
		|				ИЗ
		|					ТабПогашенныхИСписанных КАК ТабПогашенныхИСписанных))
		|	И ТабСерийныеНомера.Ссылка В
		|			(ВЫБРАТЬ
		|				ТабРеализованных.СерийныйНомер
		|			ИЗ
		|				ТабРеализованных КАК ТабРеализованных)";
	КонецЕсли;
		
	Запрос.УстановитьПараметр("МассивСерийныхНомеров", МассивСерийныхНомеров);
	Запрос.УстановитьПараметр("МассивИспользуемыхСерийныхНомеров", МассивИспользуемыхСерийныхНомеров);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Результат = Запрос.Выполнить();
	
	ТаблицаЗапроса = Результат.Выгрузить();
		
	Возврат ТаблицаЗапроса;

КонецФункции // ПолучитьТаблицуСерийныхНомеров()

// Функция подбирает таблицу серийных номеров
//
// Параметры:
//  Текст   - введенный текст
//  ТекстАвтоПодбора - текст авто подбора
//  МассивИспользуемыхСерийныхНомеров - Уже выбранные серийные номера
//  Номенклатура - номенклатура поиска
//  ТипСерийногоНомера - тип серийного номера номенклатуры
//
// ВозвращаемоеЗначение
//  Массив
//
Функция ПодобратьМассивСерийныхНомеров(СтруктураПараметров, Текст) Экспорт
	Перем Номенклатура, ТипСерийногоНомера, СерийныеНомера, Дата, ЭтоРеализация;
	
	МассивРезультата = Новый Массив;
	
	Если Не ТипЗнч(СтруктураПараметров) = Тип("Структура") Тогда
		Возврат МассивРезультата;
	КонецЕсли;
	
	СтруктураПараметров.Свойство("ЭтоРеализация"     , ЭтоРеализация);
	СтруктураПараметров.Свойство("Номенклатура"      , Номенклатура);
	СтруктураПараметров.Свойство("ТипСерийногоНомера", ТипСерийногоНомера);
	СтруктураПараметров.Свойство("СерийныеНомера"    , СерийныеНомера);
	СтруктураПараметров.Свойство("Дата"              , Дата);
	
	МассивИспользуемыхСерийныхНомеров = СерийныеНомера.Выгрузить().ВыгрузитьКолонку("СерийныйНомер");
	
	Если СтруктураПараметров.Свойство("МассивИспользованныхСерийныхНомеров") Тогда
		
		Для каждого ЭлементМассива Из СтруктураПараметров.МассивИспользованныхСерийныхНомеров Цикл
			
			МассивИспользуемыхСерийныхНомеров.Добавить(ЭлементМассива);
			
		КонецЦикла;
		
	КонецЕсли;
	
	МассивСерийныхНомеров = МаркетинговыеАкцииСервер.ПодобратьСерийныеНомераПоТексту(Текст, МассивИспользуемыхСерийныхНомеров, Номенклатура, ТипСерийногоНомера);
	
	Если МассивСерийныхНомеров.Количество() > 0  Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СерийныеНомера.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТабСерийныеНомера
		|ИЗ
		|	Справочник.СерийныеНомера КАК СерийныеНомера
		|ГДЕ
		|	СерийныеНомера.Ссылка В(&МассивСерийныхНомеров)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////";
		Если ЭтоРеализация Тогда
		
			Запрос.Текст = Запрос.Текст + Символы.ПС + 
			"ВЫБРАТЬ
			|	ДвиженияСерийныхНомеровСрезПоследних.СерийныйНомер
			|ПОМЕСТИТЬ ТабНеПравильныхСерийныхНомеров
			|ИЗ
			|	РегистрСведений.ДвиженияСерийныхНомеров.СрезПоследних(
			|			&Дата,
			|			СерийныйНомер В
			|					(ВЫБРАТЬ
			|						ТабСерийныеНомера.Ссылка
			|					ИЗ
			|						ТабСерийныеНомера КАК ТабСерийныеНомера)
			|				И (АналитикаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.АналитикаХозяйственныхОпераций.РеализацияТоваров)
			|					ИЛИ АналитикаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.АналитикаХозяйственныхОпераций.ПогашениеПодарочныхСертификатов)
			|					ИЛИ АналитикаХозяйственнойОперации.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаЗатраты)
			|					ИЛИ АналитикаХозяйственнойОперации.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПоИнвентаризации))) КАК ДвиженияСерийныхНомеровСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТабСерийныеНомера.Ссылка
			|ИЗ
			|	ТабСерийныеНомера КАК ТабСерийныеНомера
			|ГДЕ
			|	(НЕ ТабСерийныеНомера.Ссылка В
			|				(ВЫБРАТЬ
			|					ТабНеПравильныхСерийныхНомеров.СерийныйНомер
			|				ИЗ
			|					ТабНеПравильныхСерийныхНомеров КАК ТабНеПравильныхСерийныхНомеров))";
			
		Иначе
			Запрос.Текст = Запрос.Текст + Символы.ПС + 
			"ВЫБРАТЬ
			|	ДвиженияСерийныхНомеровСрезПоследних.СерийныйНомер
			|ПОМЕСТИТЬ ТабРеализованных
			|ИЗ
			|	РегистрСведений.ДвиженияСерийныхНомеров.СрезПоследних(
			|			&Дата,
			|			СерийныйНомер В
			|					(ВЫБРАТЬ
			|						ТабСерийныеНомера.Ссылка
			|					ИЗ
			|						ТабСерийныеНомера КАК ТабСерийныеНомера)
			|				И (АналитикаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.АналитикаХозяйственныхОпераций.РеализацияТоваров)
			|					ИЛИ АналитикаХозяйственнойОперации.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаЗатраты)
			|					ИЛИ АналитикаХозяйственнойОперации.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПоИнвентаризации))) КАК ДвиженияСерийныхНомеровСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ДвиженияСерийныхНомеровСрезПоследних.СерийныйНомер
			|ПОМЕСТИТЬ ТабПогашенныхИСписанных
			|ИЗ
			|	РегистрСведений.ДвиженияСерийныхНомеров.СрезПоследних(
			|			&Дата,
			|			СерийныйНомер В
			|					(ВЫБРАТЬ
			|						ТабСерийныеНомера.Ссылка
			|					ИЗ
			|						ТабСерийныеНомера КАК ТабСерийныеНомера)
			|				И (АналитикаХозяйственнойОперации = ЗНАЧЕНИЕ(Справочник.АналитикаХозяйственныхОпераций.ПогашениеПодарочныхСертификатов)
			|					ИЛИ АналитикаХозяйственнойОперации.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеНаЗатраты)
			|					ИЛИ АналитикаХозяйственнойОперации.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеПоИнвентаризации))) КАК ДвиженияСерийныхНомеровСрезПоследних
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТабСерийныеНомера.Ссылка
			|ИЗ
			|	ТабСерийныеНомера КАК ТабСерийныеНомера
			|ГДЕ
			|	(НЕ ТабСерийныеНомера.Ссылка В
			|				(ВЫБРАТЬ
			|					ТабПогашенныхИСписанных.СерийныйНомер
			|				ИЗ
			|					ТабПогашенныхИСписанных КАК ТабПогашенныхИСписанных))
			|	И ТабСерийныеНомера.Ссылка В
			|			(ВЫБРАТЬ
			|				ТабРеализованных.СерийныйНомер
			|			ИЗ
			|				ТабРеализованных КАК ТабРеализованных)";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("МассивСерийныхНомеров", МассивСерийныхНомеров);
		Запрос.УстановитьПараметр("МассивИспользуемыхСерийныхНомеров", МассивИспользуемыхСерийныхНомеров);
		Запрос.УстановитьПараметр("Дата", Дата);
		
		Результат = Запрос.Выполнить();
		ТаблицаЗапроса = Результат.Выгрузить();
		МассивРезультата = ТаблицаЗапроса.ВыгрузитьКолонку("Ссылка")
	КонецЕсли;
	
	Возврат МассивРезультата;
	

КонецФункции // ПодобратьМассивСерийныхНомеров()
